#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cloudacode/vpc-provisioing-ipam/runs/run-NbHre6xLSUziyYHs

Waiting for the plan to start...

Terraform v1.3.7
on linux_amd64
Initializing plugins and modules...
data.aws_vpc_ipam_pool.this: Reading...
data.aws_vpc_ipam_pool.this: Read complete after 0s [id=ipam-pool-08ecf378574aa542e]
data.aws_vpc_ipam_preview_next_cidr.this: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ad55648028bbf765]
data.aws_vpc_ipam_preview_next_cidr.this: Read complete after 1s [id=10.3.0.0/16_ipam-pool-08ecf378574aa542e]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-097ec60e3b7ad5680]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-09969a9e1231bd59b]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-01cf9eecedd313f41]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0392a3fcadca41451]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-09452dc70e5c9ab06]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-09452dc70e5c9ab061080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-01cf9eecedd313f41"
      ~ tags     = {
          ~ "Env"  = "prod" -> "dev"
          ~ "Name" = "cloudacode-prod" -> "cloudacode-dev"
            # (1 unchanged element hidden)
        }
      ~ tags_all = {
          ~ "Env"  = "prod" -> "dev"
          ~ "Name" = "cloudacode-prod" -> "cloudacode-dev"
            # (1 unchanged element hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-09969a9e1231bd59b"
      ~ tags             = {
          ~ "Env"  = "prod" -> "dev"
          ~ "Name" = "cloudacode-prod-private-us-east-1a" -> "cloudacode-dev-private-us-east-1a"
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          ~ "Env"  = "prod" -> "dev"
          ~ "Name" = "cloudacode-prod-private-us-east-1a" -> "cloudacode-dev-private-us-east-1a"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[1] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0392a3fcadca41451"
      ~ tags             = {
          ~ "Env"  = "prod" -> "dev"
          ~ "Name" = "cloudacode-prod-private-us-east-1b" -> "cloudacode-dev-private-us-east-1b"
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          ~ "Env"  = "prod" -> "dev"
          ~ "Name" = "cloudacode-prod-private-us-east-1b" -> "cloudacode-dev-private-us-east-1b"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.private[2] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-097ec60e3b7ad5680"
      ~ tags             = {
          ~ "Env"  = "prod" -> "dev"
          ~ "Name" = "cloudacode-prod-private-us-east-1c" -> "cloudacode-dev-private-us-east-1c"
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          ~ "Env"  = "prod" -> "dev"
          ~ "Name" = "cloudacode-prod-private-us-east-1c" -> "cloudacode-dev-private-us-east-1c"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-09452dc70e5c9ab06"
      ~ tags             = {
          ~ "Env"  = "prod" -> "dev"
          ~ "Name" = "cloudacode-prod-public" -> "cloudacode-dev-public"
            # (1 unchanged element hidden)
        }
      ~ tags_all         = {
          ~ "Env"  = "prod" -> "dev"
          ~ "Name" = "cloudacode-prod-public" -> "cloudacode-dev-public"
            # (1 unchanged element hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-09969a9e1231bd59b"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-0392a3fcadca41451"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-097ec60e3b7ad5680"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-09452dc70e5c9ab06"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-09452dc70e5c9ab06"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-09452dc70e5c9ab06"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "dev"
          + "Name" = "cloudacode-dev-private-us-east-1a"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "dev"
          + "Name" = "cloudacode-dev-private-us-east-1a"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = "vpc-0ad55648028bbf765"
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "dev"
          + "Name" = "cloudacode-dev-private-us-east-1b"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "dev"
          + "Name" = "cloudacode-dev-private-us-east-1b"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = "vpc-0ad55648028bbf765"
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.32.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "dev"
          + "Name" = "cloudacode-dev-private-us-east-1c"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "dev"
          + "Name" = "cloudacode-dev-private-us-east-1c"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = "vpc-0ad55648028bbf765"
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.64.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "dev"
          + "Name" = "cloudacode-dev-public-us-east-1a"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "dev"
          + "Name" = "cloudacode-dev-public-us-east-1a"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = "vpc-0ad55648028bbf765"
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.80.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "dev"
          + "Name" = "cloudacode-dev-public-us-east-1b"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "dev"
          + "Name" = "cloudacode-dev-public-us-east-1b"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = "vpc-0ad55648028bbf765"
    }

  # module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.3.96.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Env"  = "dev"
          + "Name" = "cloudacode-dev-public-us-east-1c"
          + "Org"  = "cloudacode.com"
        }
      + tags_all                                       = {
          + "Env"  = "dev"
          + "Name" = "cloudacode-dev-public-us-east-1c"
          + "Org"  = "cloudacode.com"
        }
      + vpc_id                                         = "vpc-0ad55648028bbf765"
    }

  # module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-0ad55648028bbf765"
      ~ tags                                 = {
          ~ "Env"  = "prod" -> "dev"
          ~ "Name" = "cloudacode-prod" -> "cloudacode-dev"
            # (1 unchanged element hidden)
        }
      ~ tags_all                             = {
          ~ "Env"  = "prod" -> "dev"
          ~ "Name" = "cloudacode-prod" -> "cloudacode-dev"
            # (1 unchanged element hidden)
        }
        # (18 unchanged attributes hidden)
    }

Plan: 12 to add, 6 to change, 0 to destroy.


```

</details>

*Pushed by: @kcfigaro, Action: `pull_request`*